# # HomeWork 3. Task 1.
# Задайте список, состоящий из произвольных чисел, количество задаёт пользователь.
# Напишите программу, которая найдет сумму элементов списка,
# стоящих на нечётных позициях (не индексах).
# 4 -> [7, 9, 2, 3] -> 9
# 5 -> [2, 5, 2, 7, 9] -> 13

# # -----------1 СПОСОБ (с использованием for):----------
# import random
# print('Найдем сумму сумму элементов списка, стоящих на нечётных позициях (не индексах).')
# number = int(input('Введите требуемое количество элементов списка - '))
# list = [random.randint(0, 10) for i in range(0, number)]
# print(list)
# sum = 0
# for i in range(0, number):
#     if i % 2 == 0:
#         sum = sum+list[i]
# print('Cумма элементов списка, стоящих на нечётных позициях =', sum)

# # ----------2 СПОСОБ (с использованием while):----------
# import random
# print('Найдем сумму сумму элементов списка, стоящих на нечётных позициях (не индексах).')
# number = int(input('Введите требуемое количество элементов списка - '))
# list = [random.randint(0, 10) for i in range(0, number)]
# print(list)
# sum = 0
# count = 0
# while count < number:
#     sum = sum+list[count]
#     count += 2
# print('Cумма элементов списка, стоящих на нечётных позициях =', sum)

# # ----------3 СПОСОБ (с использованием функции):----------
import random
print('Найдем сумму сумму элементов списка, стоящих на нечётных позициях (не индексах).')
number = int(input('Введите требуемое количество элементов списка - '))


def sum_element():
    list = [random.randint(0, 10) for i in range(0, number)]
    print(list)
    sum = 0
    for i in range(0, number):
        if i % 2 == 0:
            sum = sum+list[i]
    print('Cумма элементов списка, стоящих на нечётных позициях =', sum)

sum_element()
